import phone from '../../assets/images/phone.png';
import Container from '../../ui/Container/Container';
import styles from './Telegram.module.css';

function Telegram() {
  return (
    <Container classes={styles.telegram}>
      <div className={styles.telegram__container}>
        <div className={styles.telegram__wrapper}>
          <div className={styles.telegram__content}>
            <div className={styles.telegram__header}>
              <h2 className={styles.telegram__title}>Телеграм</h2>
              <span className={styles.telegram__text}>
                Стань частью новой культуры:подпишись на нас
              </span>
            </div>

            <p className={styles.telegram__desc}>
              Задача организации, в особенности же новая модель организационной
              деятельности требуют определения и уточнения модели развития. Не
              следует, однако забывать, что реализация намеченных плановых
              заданий требуют определения и уточнения позиций, занимаемых
              участниками в отношении поставленных задач.
            </p>
            <a
              className={styles.telegram__link}
              href="https://t.me/+0VbjiJq5IbhiODEy"
            >
              Стать частью толка
            </a>
            <img
              className={styles.telegram__images}
              src={phone}
              alt="telegram"
              aria-hidden="true"
            />
          </div>
        </div>
      </div>
      <div className={styles.container}>
        <div className={styles.telegram__platform}>
          <div className={styles.telegram__platform_inner}>
            <div className={styles.telegram__platform_text}>
              Читать нас на других плафтормах
            </div>
            <div className={styles.telegram__platform_links}>
              <a href="https://t.me/+0VbjiJq5IbhiODEy">
                <svg
                  width="84"
                  height="84"
                  viewBox="0 0 84 84"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M42 84C65.196 84 84 65.196 84 42C84 18.804 65.196 0 42 0C18.804 0 0 18.804 0 42C0 65.196 18.804 84 42 84ZM48.0394 62.0417L57.4626 25.3085C57.6629 24.5277 56.9428 23.8229 56.1665 24.0398L19.7657 34.2114C18.8923 34.4555 18.7209 35.6188 19.4868 36.1043L31.3051 43.597C31.6616 43.823 32.1189 43.8129 32.4651 43.5713L46.6196 33.6917L35.5318 46.3635C35.2098 46.7314 35.1853 47.2732 35.4728 47.6687L46.1781 62.3971C46.6991 63.1139 47.8193 62.8999 48.0394 62.0417Z"
                    fill="#554DFF"
                  />
                </svg>
              </a>
              <a href="https://vk.com/tolkportal">
                <svg
                  width="84"
                  height="84"
                  viewBox="0 0 84 84"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M42 0C18.8055 0 0 18.8055 0 42C0 65.1945 18.8055 84 42 84C65.1945 84 84 65.1945 84 42C84 18.8055 65.1945 0 42 0ZM64.2635 55.8845L57.7255 55.9755C57.7255 55.9755 56.315 56.252 54.4705 54.978C52.024 53.298 49.7175 48.9265 47.9185 49.4935C46.095 50.0745 46.151 54.0085 46.151 54.0085C46.151 54.0085 46.165 54.7015 45.7485 55.153C45.297 55.6395 44.4115 55.5905 44.4115 55.5905H41.482C41.482 55.5905 35.021 56.126 29.3265 50.19C23.1245 43.7185 17.6435 30.947 17.6435 30.947C17.6435 30.947 17.3215 30.142 17.6645 29.729C18.053 29.274 19.0995 29.26 19.0995 29.26L26.0995 29.225C26.0995 29.225 26.7575 29.3405 27.2335 29.6905C27.622 29.9775 27.8425 30.5165 27.8425 30.5165C27.8425 30.5165 28.973 33.383 30.4745 35.98C33.4005 41.041 34.7585 42.1505 35.7525 41.608C37.2015 40.817 36.7675 34.454 36.7675 34.454C36.7675 34.454 36.7955 32.144 36.0395 31.115C35.4515 30.3135 34.3455 30.0755 33.8625 30.016C33.467 29.9635 34.111 29.0465 34.951 28.6335C36.211 28.0175 38.437 27.9825 41.0655 28.007C43.113 28.028 43.7045 28.154 44.5025 28.35C46.9175 28.9345 46.0985 31.1885 46.0985 36.596C46.0985 38.3285 45.787 40.7645 47.033 41.566C47.572 41.9125 48.8845 41.6185 52.157 36.0395C53.7145 33.3935 54.88 30.2855 54.88 30.2855C54.88 30.2855 55.1355 29.7325 55.531 29.4945C55.937 29.2495 56.483 29.3265 56.483 29.3265L63.8505 29.281C63.8505 29.281 66.0625 29.015 66.423 30.0195C66.801 31.0695 65.597 33.523 62.587 37.5375C57.645 44.1315 57.0955 43.519 61.201 47.334C65.121 50.9775 65.9295 52.7485 66.066 52.9725C67.6865 55.671 64.2635 55.8845 64.2635 55.8845Z"
                    fill="#554DFF"
                  />
                </svg>
              </a>
              <a href="https://dzen.ru/tolkportal">
                <svg
                  width="84"
                  height="84"
                  viewBox="0 0 84 84"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M0 42.0062C0.00335693 65.1972 18.8027 83.9967 41.9938 84C41.4749 83.9973 40.9576 83.6654 40.8792 83.0042L39.5577 71.8673C37.8514 57.4867 26.5133 46.1486 12.1326 44.4423L0.995667 43.1208C0.334534 43.0423 0.00262451 42.5251 0 42.0062Z"
                    fill="#554DFF"
                  />
                  <path
                    d="M42.0062 84C65.1993 83.9967 84 65.1939 84 42C84 18.804 65.196 0 42 0C18.8061 0 0.00335693 18.8007 0 41.9938C0.00262451 41.4749 0.334534 40.9577 0.995667 40.8792L12.1326 39.5577C26.5133 37.8514 37.8514 26.5133 39.5577 12.1326L40.8792 0.995651C41.0368 -0.331879 42.9632 -0.331879 43.1208 0.995651L44.4423 12.1326C46.1486 26.5133 57.4867 37.8514 71.8673 39.5577L83.0042 40.8792C84.3319 41.0368 84.3319 42.9632 83.0042 43.1208L71.8673 44.4423C57.4867 46.1486 46.1486 57.4867 44.4423 71.8673L43.1208 83.0042C43.0424 83.6654 42.5251 83.9973 42.0062 84Z"
                    fill="#554DFF"
                  />
                </svg>
              </a>
            </div>
          </div>
        </div>
      </div>
    </Container>
  );
}

export default Telegram;
