export const ABOUT_DATA = [
  {
    text: 'Привет! В нашем пространстве мы всегда стараемся вдохновлять наших участников на творчество, поиск новых идей и решений, объединять, поддерживать, выходить за рамки обыденности, осуществлять мечты.',
  },
  {
    text: 'Культура созидания - это отношение к жизни, к работе, к окружающей среде. Это способность видеть проблемы как вызовы, а не препятствия. И находить в них возможности для роста и развития.',
  },
  {
    text: 'Она основана на внутреннем процессе созидания, который позволяет человеку познавать себя, окружающий мир и находить новые идеи и решения для творческого изменения реальности',
  },
];

export const WHYWE_DATA = [
  {
    text: 'Мы верим, что Культура Созидания – ключ к более справедливому, устойчивому и вдохновляющему будущем. Вместе мы работаем над проектами, инициативами и обменом идеями, чтобы создать мир, где цветут творчество, равенство и взаимопонимание.',
  },
  {
    text: 'Присоединяйтесь к нашей глобальной движению, где каждый – важное звено в цепи положительных изменений. Давайте вместе творить Культуру Созидания!',
  },
];

export const WHYWE_BENIFFITS_DATA = [
  {
    title: 'Уважение к разнообразию',
    desc: 'Мы ценим разнообразие культур, мнений и личных историй. Разнообразие делает нас богаче и позволяет нам учиться друг у друга.',
  },
  {
    title: 'Экологическая осознанность',
    desc: 'Мы понимаем, что наше благополучие тесно связано со здоровьем нашей планеты. Мы заботимся о природе и работаем над устойчивыми практиками.',
  },
  {
    title: 'Дополнительность и обогащение',
    desc: 'Мы всегда готовы в сообществе Культуры созидания дополнить идеи и инициативы других и готовы к тому, что дополнят и наши идеи и инициативы. Тем самым мы обогатим друг друга.',
  },
  {
    title: 'Вдохновение к Дарению',
    desc: 'Подчеркивает активное поощрение обмена идеями, поддержки творческого потенциала и готовности дарить знания, опыт и ресурсы для обогащения всего сообщества Культуры Созидания.',
  },
  {
    title: 'Ответственность',
    desc: 'Мы признаем, что каждый из нас несет ответственность за состояние мира и общества. Мы готовы действовать ответственно и принимать решения, учитывающие общее благо.',
  },
  {
    title: 'Несение миссии',
    desc: 'Мы ощущаем себя носителями миссии Культуры Созидания в этот мир.',
  },
];

export const SERVICES_ITEM_DATA = [
  {
    id: '0',
    images: 'public/images/01.png',
    title: 'Дизайн и творчество',
    futures: [
      {
        text: 'Разработка уникального дизайна, который отражает ваши ценности и магнетизирует внимание',
      },
      {
        text: 'Создание эстетически привлекательных визуальных элементов для вашего бренда.',
      },
    ],
  },
  {
    id: '2',
    images: 'public/images/02.png',
    title: 'Веб-решение и разработка сайтов',
    futures: [
      {
        text: 'Разработка современных и функциональных веб-сайтов, идеально соответствующих вашим потребностям.',
      },
      {
        text: ' Интеграция передовых технологий для эффективного онлайн-присутствия вашего бизнеса.',
      },
    ],
  },
  {
    id: '3',
    images: 'public/images/03.png',
    title: 'Масштабирование и развитие',
    futures: [
      {
        text: 'Разработка стратегий масштабирования для устойчивого и гармоничного роста вашей организации.',
      },
      {
        text: 'Поддержка в вопросах расширения влияния и повышения эффективности деятельности.',
      },
    ],
  },
  {
    id: '4',
    images: 'public/images/04.png',
    title: 'Запуск Новых Направлений',
    futures: [
      {
        text: 'Планирование и внедрение инновационных направлений, дополняющих ваш бизнес.',
      },
      {
        text: 'Поддержка вашей организации в активном участии в творческом развитии..',
      },
    ],
  },
  {
    id: '5',
    images: 'public/images/05.png',
    title: 'Командообразование и Управление',
    futures: [
      {
        text: 'Создание и развитие высокоэффективных команд, способных достигать поставленных целей.',
      },
      {
        text: 'Обучение лидеров и управленцев для оптимального управления командами.',
      },
    ],
  },
  {
    id: '6',
    images: 'public/images/06.png',
    title: 'Стратегическое Планирование',
    futures: [
      {
        text: 'Разработка персонализированных стратегий, направленных на достижение ваших ключевых целей.',
      },
      {
        text: 'Поддержка в формировании и реализации ваших стратегических инициатив.',
      },
    ],
  },
  {
    id: '7',
    images: 'public/images/07.png',
    title:
      'Процессор сопровождения через методологию кратного роста бизнес-трекера',
    futures: [
      {
        text: 'Его задачи включают оптимизацию юнит-экономики, выявление новых сегментов потребителей, запуск междугородних и международных продаж, а также внесение изменений, способствующих увеличению прибыли. .',
      },
      {
        text: 'Результативность работы трекера измеряется успешной реализацией гипотез, скоростью прироста прибыли и количеством обнаруженных и устраненных «узких мест» в бизнесе.',
      },
    ],
  },
  {
    id: '8',
    images: 'public/images/08.png',
    title: 'Подбор и Формирование Команды',
    futures: [
      {
        text: 'Мы предоставляем экспертное сопровождение при подборе и формировании команды, идеально подходящей под ваш проект.',
      },
      {
        text: 'Работая с нашей студией, вы получаете команду профессионалов, способных эффективно воплощать ваши идеи в жизнь',
      },
    ],
  },
];
